openwch/ch32m030/EVT/EXAM/SRC/Peripheral/src/ch32m030_tim.c
    TIMx->CHCTLR1 = tmpccmr1;
    TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TI3_Config
 *
 * @brief   Configure the TI3 as Input.
 *
 * @param   TIMx - where x can be 1 to 2 select the TIM peripheral.
 *          IM_ICPolarity - The Input Polarity.
 *             TIM_ICPolarity_Rising.
 *             TIM_ICPolarity_Falling.
 *          TIM_ICSelection - specifies the input to be used.
 *             TIM_ICSelection_DirectTI - TIM Input 3 is selected to be
 *        connected to IC1.
 *             TIM_ICSelection_IndirectTI - TIM Input 3 is selected to be
 *        connected to IC2.
 *             TIM_ICSelection_TRC - TIM Input 3 is selected to be connected
 *        to TRC.
 *          TIM_ICFilter - Specifies the Input Capture Filter.
 *            This parameter must be a value between 0x00 and 0x0F.
 *
 * @return  none
 */
static void TI3_Config(TIM_TypeDef *TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{
    uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

    TIMx->CCER &= (uint16_t) ~((uint16_t)TIM_CC3E);
    tmpccmr2 = TIMx->CHCTLR2;
    tmpccer = TIMx->CCER;
    tmp = (uint16_t)(TIM_ICPolarity << 8);
    tmpccmr2 &= (uint16_t)(((uint16_t) ~((uint16_t)TIM_CC3S)) & ((uint16_t) ~((uint16_t)TIM_IC3F)));

    TIMx->CHCTLR2 |= (uint16_t)(TIM_ICSelection);
    tmpccmr2 |= (uint16_t)(TIM_ICSelection | (uint16_t)(TIM_ICFilter << (uint16_t)4));
    tmpccer &= (uint16_t) ~((uint16_t)(TIM_CC3P));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TIM_CC3E);

    TIMx->CHCTLR2 = tmpccmr2;
    TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TI4_Config
 *
 * @brief   Configure the TI4 as Input.
 *
 * @param   TIMx - where x can be 1 to 2 select the TIM peripheral.
 *          IM_ICPolarity - The Input Polarity.
 *             TIM_ICPolarity_Rising.
 *             TIM_ICPolarity_Falling.
 *          TIM_ICSelection - specifies the input to be used.
 *             TIM_ICSelection_DirectTI - TIM Input 4 is selected to be
 *        connected to IC1.
 *             TIM_ICSelection_IndirectTI - TIM Input 4 is selected to be
 *        connected to IC2.
 *             TIM_ICSelection_TRC - TIM Input 4 is selected to be connected
 *        to TRC.
 *          TIM_ICFilter - Specifies the Input Capture Filter.
 *            This parameter must be a value between 0x00 and 0x0F.
 *
 * @return  none
 */
static void TI4_Config(TIM_TypeDef *TIMx, uint16_t TIM_ICPolarity, uint16_t TIM_ICSelection,
                       uint16_t TIM_ICFilter)
{
    uint16_t tmpccmr2 = 0, tmpccer = 0, tmp = 0;

    TIMx->CCER &= (uint16_t) ~((uint16_t)TIM_CC4E);
    tmpccmr2 = TIMx->CHCTLR2;
    tmpccer = TIMx->CCER;
    tmp = (uint16_t)(TIM_ICPolarity << 12);
    tmpccmr2 &= (uint16_t)((uint16_t)(~(uint16_t)TIM_CC4S) & ((uint16_t) ~((uint16_t)TIM_IC4F)));

    TIMx->CHCTLR2 |= (uint16_t)(TIM_ICSelection << 8);
    tmpccmr2 |= (uint16_t)(TIM_ICSelection << 8) | (uint16_t)(TIM_ICFilter << 12);
    tmpccer &= (uint16_t) ~((uint16_t)(TIM_CC4P));
    tmpccer |= (uint16_t)(tmp | (uint16_t)TIM_CC4E);

    TIMx->CHCTLR2 = tmpccmr2;
    TIMx->CCER = tmpccer;
}

/*********************************************************************
 * @fn      TIM_IndicateCaptureLevelCmd
 *
 * @brief   Enables or disables the TIMx capture level indication.
 *
 * @param   TIMx - where x can be 1 to 3 select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_IndicateCaptureLevelCmd(TIM_TypeDef *TIMx, FunctionalState NewState)
{
    if(NewState)
    {
        TIMx->CTLR1 |= (1<<15);
    }
    else{
        TIMx->CTLR1 &= ~(1<<15);
    }
}

/*********************************************************************
 * @fn      TIM2_DeadTimeConfig
 *
 * @brief   Configures the TIM2 complementary output dead time.
 *
 * @param   TIMx - where x can be 2 to select the TIM peripheral.
 *          DeadTime - This parameter can be a number between 0x00 and 0xFF.
 *          TIM_DTPolarity - TIM2 dead time Polarity.
 *            TIM_DTPolarity_Rising - TIM2 dead time Polarity rising.
 *            TIM_DTPolarity_Falling - TIM2 dead time Polarity falling.
 *          DT_DIV - DeadTime counting frequency division.
 *            TIM_DT_DIV1 - DeadTime counting frequency division by 1.
 *            TIM_DT_DIV4 - DeadTime counting frequency division by 4.
 *
 * @return  none
 */
void TIM2_DeadTimeConfig(TIM_TypeDef *TIMx, uint16_t TIM_DTPolarity, uint8_t DeadTime, uint8_t DT_DIV)
{
    if(TIMx == TIM2)
    {
        TIMx->TIM2_DTCR &= ~((0xF << (TIM_DTPolarity + 8)));
        TIMx->TIM2_DTCR |= ((uint16_t)DeadTime) << (TIM_DTPolarity + 8);
        TIMx->TIM2_DTCR &= ~(1 << 6);
        TIMx->TIM2_DTCR |= (DT_DIV << 6);
    }
}

/*********************************************************************
 * @fn      TIM3_DeadTimeConfig
 *
 * @brief   Configures the TIM3 complementary output dead time.
 *
 * @param   TIMx - where x can be 3 to select the TIM peripheral.
 *          DeadTime - This parameter can be a number between 0x00 and 0xFF.
 *          TIM_Channel - TIM2 out channel.
 *            TIM_Channel_1 - TIM output Channel 1.
 *            TIM_Channel_2 - TIM output Channel 2.
 *          DT_DIV - DeadTime counting frequency division.
 *            TIM_DT_DIV1 - DeadTime counting frequency division by 1.
 *            TIM_DT_DIV4 - DeadTime counting frequency division by 4.
 *
 * @return  none
 */
void TIM3_DeadTimeConfig(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint8_t DeadTime, uint8_t DT_DIV)
{
     if(TIMx == TIM3)
    {
        if(TIM_Channel == TIM_Channel_1)
        {
            TIMx->SMCFGR &= ~(0xF<<8);
            TIMx->SMCFGR |= ((uint16_t)DeadTime << 8);
            TIMx->CTLR1 &= ~(1<<10);
            TIMx->CTLR1 |= (1<<10);
        }
        else if(TIM_Channel == TIM_Channel_2)
        {
            TIMx->SMCFGR &= ~(0xF<<12);
            TIMx->SMCFGR |= ((uint16_t)DeadTime << 12);
            TIMx->CTLR1 &= ~(1<<11);
            TIMx->CTLR1 |= (1<<11);
        }

        TIMx->CCER &= ~(1 << 12);
        TIMx->CCER |= (DT_DIV << 12);
    }
}

/*********************************************************************
 * @fn      TIM_CLKSourceConfig
 *
 * @brief   Configures the TIMx clock source.
 *
 * @param   TIMx - where x can be 1 to 3 to select the TIM peripheral.
 *          TIM_CLKSource - specifies the PLL entry clock source.
 *            TIM_CLKSource_HCLK - HCLK clock selected as TIMx
 *        clock entry.
 *            TIM_CLKSource_PLL - HPLL clock selected as TIMx
 *        clock entry.
 *
 * @return  none
 */
void TIM_CLKSourceConfig(TIM_TypeDef *TIMx, uint32_t TIM_CLKSource)
{
    if(TIMx == TIM1)
    {
        TIMx->TIM1_AUX1 &= ~(TIM_CLKSource_PLL << 14);
        TIMx->TIM1_AUX1 |= (TIM_CLKSource << 14);
    }
    else if(TIMx == TIM2)
    {
        TIMx->CTLR2 &= ~(TIM_CLKSource_PLL << 9);
        TIMx->CTLR2 |= (TIM_CLKSource << 9);
    }
    else if(TIMx == TIM3)
    {
        TIMx->CCER &= ~(TIM_CLKSource_PLL << 13);
        TIMx->CCER |= (TIM_CLKSource << 13);
    }
}

/*********************************************************************
 * @fn      TIM_CapEdgeADC_Cmd
 *
 * @brief   Enables or disables the ADC edge capture.
 *
 * @param   TIMx - where x can be 1 to 3 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_CapEdgeADC_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 |= (1 << 10);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 |= (1 << 8);
        }
        else if(TIMx == TIM3)
        {
            TIMx->CCER |= (1 << 11);
        }
    }
    else
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 &= ~(1 << 10);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 &= ~(1 << 8);
        }
        else if(TIMx == TIM3)
        {
            TIMx->CCER &= ~(1 << 11);
        }
    }
}

/*********************************************************************
 * @fn      TIM_IC2BothEdge_Cmd
 *
 * @brief   Enables or disables the Both edge capture of the TIMx Channel2.
 *
 * @param   TIMx - where x can be 1 to 3 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_IC2BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 |= (1 << 0);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 |= (1 << 0);
        }
        else if(TIMx == TIM3)
        {
            TIMx->CCER |= (1 << 10);
        }
    }
    else
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 &= ~(1 << 0);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 &= ~(1 << 0);
        }
        else if(TIMx == TIM3)
        {
            TIMx->CCER &= ~(1 << 10);
        }
    }
}

/*********************************************************************
 * @fn      TIM_IC3BothEdge_Cmd
 *
 * @brief   Enables or disables the Both edge capture of the TIMx Channel3.
 *
 * @param   TIMx - where x can be 1 to 2 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_IC3BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 |= (1 << 1);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 |= (1 << 1);
        }
    }
    else
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 &= ~(1 << 1);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 &= ~(1 << 1);
        }
    }
}

/*********************************************************************
 * @fn      TIM_IC4BothEdge_Cmd
 *
 * @brief   Enables or disables the Both edge capture of the TIMx Channel4.
 *
 * @param   TIMx - where x can be 1 to 2 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_IC4BothEdge_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 |= (1 << 2);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 |= (1 << 2);
        }
    }
    else
    {
        if(TIMx == TIM1)
        {
            TIMx->TIM1_AUX1 &= ~(1 << 2);
        }
        else if(TIMx == TIM2)
        {
            TIMx->CTLR2 &= ~(1 << 2);
        }
    }
}

/*********************************************************************
 * @fn      TIM_DeadTimeAsymmetricConfig
 *
 * @brief   Configures the TIMx complementary output asymmetric dead time.
 *
 * @param   TIMx - where x can be 1 to select the TIM peripheral.
 *          AsymmetricDeadTime - This parameter can be a number between 0x00
 *        and BDTR DTG[7:0].
 *          DT_MODE - Dead time mode.
 *            TIM_DT_MODE_Disable - Disable Dead time mode.
 *            TIM_DT_MODE_Rising - Dead time mode occur to the rising of OCXREF.
 *            TIM_DT_MODE_Falling - Dead time mode occur to the falling of OCXREF.
 *            TIM_DT_MODE_BothEdge - Dead time mode occur to the falling
 *        and rising of OCXREF.
 *
 * @return  none
 */
void TIM_AsymmetricDeadTimeConfig(TIM_TypeDef *TIMx, uint8_t AsymmetricDeadTime, uint16_t DT_MODE)
{
    TIMx->TIM1_AUX2 &= ~(0x3FF);
    TIMx->TIM1_AUX2 |= (AsymmetricDeadTime | DT_MODE);
}

/*********************************************************************
 * @fn      TIM_CenterAlignedMoveToward_Cmd
 *
 * @brief   Enables or disables the center aligned move toward the TIMx.
 *
 * @param   TIMx - where x can be 1 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_CenterAlignedMoveToward_Cmd(TIM_TypeDef *TIMx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        TIMx->TIM1_AUX1 |= (1<<3);
    }
    else
    {
        TIMx->TIM1_AUX1 &= ~(1<<3);
    }
}

/*********************************************************************
 * @fn      TIM_IndependentOutput_ChannelxN_Cmd
 *
 * @brief   Enable independent PWM output function in edge alignment mode.
 *
 * @param   TIMx - where x can be 1 to select the TIM peripheral.
 *          TIM_Channel - specifies the TIM Channel.
 *            TIM_Channel_1N - TIM Channel 1N.
 *            TIM_Channel_2N - TIM Channel 2N.
 *            TIM_Channel_3N - TIM Channel 3N.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM_IndependentOutput_ChannelxN_Cmd(TIM_TypeDef *TIMx, uint16_t TIM_Channel, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        TIMx->TIM1_AUX1 |= (TIM_Channel>>1);
    }
    else
    {
        TIMx->TIM1_AUX1 &= ~(TIM_Channel>>1);
    }
}

/*********************************************************************
 * @fn      TIM_ChannelxPWMModeConfig
 *
 * @brief   Configures the mode of channelx.
 *
 * @param   TIMx - where x can be 1 to select the TIM peripheral.
 *          TIM_Channel - specifies the TIM Channel.
 *            TIM_Channel_1N - TIM Channel 1N.
 *            TIM_Channel_2N - TIM Channel 2N.
 *            TIM_Channel_3N - TIM Channel 3N.
 *            TIM_Channel_5 - TIM Channel 5.
 *          TIM_OCMode - specifies the TIM Output Compare Mode.
 *            TIM_OCMode_PWM1
 *            TIM_OCMode_PWM2
 * @return  none
 */
void TIM_ChannelxPWMModeConfig(TIM_TypeDef *TIMx, uint16_t TIM_Channel, uint16_t TIM_OCMode)
{
    if(TIM_OCMode == TIM_OCMode_PWM2)
    {
        TIMx->TIM1_AUX2 |= (TIM_Channel);
    }
    else if(TIM_OCMode == TIM_OCMode_PWM1)
    {
        TIMx->TIM1_AUX2 &= ~(TIM_Channel);
    }
}

/*********************************************************************
 * @fn      TIM2_CH2PWMOUTPinConfig
 *
 * @brief   Enables or disables TIM2 CH2 PWM output pin to PC5.
 *
 * @param   TIMx - where x can be 2 to select the TIM peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void TIM2_CH2PWMOUTPinConfig(TIM_TypeDef *TIMx, FunctionalState NewState)
{
    if(TIMx == TIM2)
    {
        if(NewState != DISABLE)
        {
            TIMx->CTLR1 |= (1<<12);
        }
        else
        {
            TIMx->CTLR1 &= ~(1<<12);
        }
    }
}
